In [3]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
#dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [9]:
inputs.columns[inputs.isna().any()]     # tells na vlaues

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [15]:
model.score(X_test,y_test)

0.7653631284916201

In [16]:
X_test[0:10]

     Pclass        Age     Fare  female  male
458       2  50.000000  10.5000       1     0
879       1  56.000000  83.1583       1     0
62        1  45.000000  83.4750       0     1
717       2  27.000000  10.5000       1     0
457       1  29.699118  51.8625       1     0
13        3  39.000000  31.2750       0     1
534       3  30.000000   8.6625       1     0
822       1  38.000000   0.0000       0     1
22        3  15.000000   8.0292       1     0
41        2  27.000000  21.0000       1     0

In [17]:
y_test[0:10]

458    1
879    1
62     0
717    1
457    1
13     0
534    0
822    0
22     1
41     0
Name: Survived, dtype: int64

In [18]:
model.predict(X_test[0:10])      # comare with ytest some accuracy

array([1, 1, 0, 1, 1, 0, 1, 0, 1, 1], dtype=int64)

In [19]:
model.predict_proba(X_test[:10])

array([[2.02168339e-02, 9.79783166e-01],
       [8.79249715e-04, 9.99120750e-01],
       [6.89295799e-01, 3.10704201e-01],
       [2.01913213e-02, 9.79808679e-01],
       [3.61682341e-03, 9.96383177e-01],
       [9.88980300e-01, 1.10196996e-02],
       [4.25293420e-02, 9.57470658e-01],
       [9.31778328e-01, 6.82216716e-02],
       [3.16597188e-02, 9.68340281e-01],
       [1.97689290e-02, 9.80231071e-01]])